In [1]:
import pandas as pd
import numpy as np

In [13]:
amount = np.random.randint(3,30,(5,4))
zoo = ['A','B','C','D','E']

In [14]:
df = pd.DataFrame(amount,index=zoo,columns=['Tiger','Lions','Deer','Elephant'])
df

   Tiger  Lions  Deer  Elephant
A     21     21    19        10
B     11     29    14         6
C     22     26     6        14
D     11     16    14        27
E      7      9    14        20

In [15]:
df.loc['A','Tiger']

21

In [16]:
df.iloc[0,0]

21

In [17]:
#get column
df['Elephant']

A    10
B     6
C    14
D    27
E    20
Name: Elephant, dtype: int32

In [18]:
#get row
df['A'] #cant do like this  , have to use loc,iloc

KeyError: 'A'

In [19]:
df.iloc[0]

Tiger       21
Lions       21
Deer        19
Elephant    10
Name: A, dtype: int32

In [12]:
df.loc['A']
#iloc it good to use when we need to change number by using for loop + function

Tiger       15
Lions       10
Deer        23
Elephant     6
Name: A, dtype: int32

In [20]:
df.iloc[0:3,0:3]
#as you can see , the slicing in the loc and i loc it inculding the last one  [first one : last one]

   Tiger  Lions  Deer
A     21     21    19
B     11     29    14
C     22     26     6

In [21]:
df.loc['A':'C','Tiger':'Deer']

   Tiger  Lions  Deer
A     21     21    19
B     11     29    14
C     22     26     6

In [22]:
df > 15

   Tiger  Lions   Deer  Elephant
A   True   True   True     False
B  False   True  False     False
C   True   True  False     False
D  False   True  False      True
E  False  False  False      True

In [25]:
df[df<15]

   Tiger  Lions  Deer  Elephant
A    NaN    NaN   NaN      10.0
B   11.0    NaN  14.0       6.0
C    NaN    NaN   6.0      14.0
D   11.0    NaN  14.0       NaN
E    7.0    9.0  14.0       NaN

In [29]:
df.Lions < 15

A    False
B    False
C    False
D    False
E     True
Name: Lions, dtype: bool

In [30]:
df[df.Lions<15]

   Tiger  Lions  Deer  Elephant
E      7      9    14        20

In [31]:
df[df['Lions'] <15]

   Tiger  Lions  Deer  Elephant
E      7      9    14        20

In [33]:
df[(df.Lions<15) & (df.Deer >7)]

   Tiger  Lions  Deer  Elephant
E      7      9    14        20

In [34]:
df[(df.Lions<15) | (df.Deer >7)]

   Tiger  Lions  Deer  Elephant
A     21     21    19        10
B     11     29    14         6
D     11     16    14        27
E      7      9    14        20

In [39]:
data2 = {'Sequence':['First', 'Second', 'Third', 'Forth'], 'Numbers': [1, 2, 3, 4]}
print(data2)

{'Sequence': ['First', 'Second', 'Third', 'Forth'], 'Numbers': [1, 2, 3, 4]}

In [41]:
df2 = pd.DataFrame(data,columns=('Sequence','Numbers'))

df2

  Sequence  Numbers
0    First        1
1   Second        2
2    Third        3
3    Forth        4

In [42]:
df2.Numbers

0    1
1    2
2    3
3    4
Name: Numbers, dtype: int64

In [43]:
df2

  Sequence  Numbers
0    First        1
1   Second        2
2    Third        3
3    Forth        4

In [46]:
df2.iloc[0:3,1]

0    1
1    2
2    3
Name: Numbers, dtype: int64

In [48]:
df2.loc[:]

  Sequence  Numbers
0    First        1
1   Second        2
2    Third        3
3    Forth        4

In [49]:
df2.iloc[:]

  Sequence  Numbers
0    First        1
1   Second        2
2    Third        3
3    Forth        4